
{

  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.4.0",
  "modelTopology": {
      "keras_version": "2.2.4-tf",
      "backend": "tensorflow",
      "model_config": {
          "class_name": "Sequential",
          "config": {
              "name": "sequential",
              "layers": [
                  {
                      "class_name": "Flatten",
                      "config": {
                          "name": "flatten",
                          "trainable": true,
                          "batch_input_shape": [
                              null,
                              112,
                              2
                          ],
                          "dtype": "float32",
                          "data_format": "channels_last"
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 224,
                          "activation": "relu",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense_1",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 224,
                          "activation": "relu",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Reshape",
                      "config": {
                          "name": "reshape",
                          "trainable": true,
                          "dtype": "float32",
                          "target_shape": [
                              224,
                              1
                          ]
                      }
                  },
                  {
                      "class_name": "Conv1D",
                      "config": {
                          "name": "conv1d",
                          "trainable": true,
                          "dtype": "float32",
                          "filters": 32,
                          "kernel_size": [
                              32
                          ],
                          "strides": [
                              1
                          ],
                          "padding": "same",
                          "data_format": "channels_last",
                          "dilation_rate": [
                              1
                          ],
                          "activation": "linear",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Conv1D",
                      "config": {
                          "name": "conv1d_1",
                          "trainable": true,
                          "dtype": "float32",
                          "filters": 32,
                          "kernel_size": [
                              32
                          ],
                          "strides": [
                              1
                          ],
                          "padding": "same",
                          "data_format": "channels_last",
                          "dilation_rate": [
                              1
                          ],
                          "activation": "linear",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Conv1D",
                      "config": {
                          "name": "conv1d_2",
                          "trainable": true,
                          "dtype": "float32",
                          "filters": 32,
                          "kernel_size": [
                              32
                          ],
                          "strides": [
                              1
                          ],
                          "padding": "same",
                          "data_format": "channels_last",
                          "dilation_rate": [
                              1
                          ],
                          "activation": "linear",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Flatten",
                      "config": {
                          "name": "flatten_1",
                          "trainable": true,
                          "dtype": "float32",
                          "data_format": "channels_last"
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense_2",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 4096,
                          "activation": "relu",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense_3",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 4096,
                          "activation": "relu",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense_4",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 4096,
                          "activation": "relu",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Dense",
                      "config": {
                          "name": "dense_5",
                          "trainable": true,
                          "dtype": "float32",
                          "units": 48,
                          "activation": "linear",
                          "use_bias": true,
                          "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                  "seed": null,
                                  "dtype": "float32"
                              }
                          },
                          "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {
                                  "dtype": "float32"
                              }
                          },
                          "kernel_regularizer": null,
                          "bias_regularizer": null,
                          "activity_regularizer": null,
                          "kernel_constraint": null,
                          "bias_constraint": null
                      }
                  },
                  {
                      "class_name": "Reshape",
                      "config": {
                          "name": "reshape_1",
                          "trainable": true,
                          "dtype": "float32",
                          "target_shape": [
                              24,
                              2
                          ]
                      }
                  }
              ]
          }
      },
      "training_config": {
          "loss": "mean_squared_error",
          "metrics": [
              "accuracy"
          ],
          "weighted_metrics": null,
          "sample_weight_mode": null,
          "loss_weights": null,
          "optimizer_config": {
              "class_name": "Adam",
              "config": {
                  "name": "Adam",
                  "learning_rate": 0.0010000000474974513,
                  "decay": 0.0,
                  "beta_1": 0.8999999761581421,
                  "beta_2": 0.9990000128746033,
                  "epsilon": 1e-07,
                  "amsgrad": false
              }
          }
      }
  },
  "weightsManifest": [
      {
          "paths": [
              "group1.bin"
          ],
          "weights": [
              {
                  "name": "conv1d/kernel",
                  "shape": [
                      32,
                      1,
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "conv1d/bias",
                  "shape": [
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "conv1d_1/kernel",
                  "shape": [
                      32,
                      32,
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "conv1d_1/bias",
                  "shape": [
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "conv1d_2/kernel",
                  "shape": [
                      32,
                      32,
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "conv1d_2/bias",
                  "shape": [
                      32
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense/kernel",
                  "shape": [
                      224,
                      224
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense/bias",
                  "shape": [
                      224
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_1/kernel",
                  "shape": [
                      224,
                      224
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_1/bias",
                  "shape": [
                      224
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_2/kernel",
                  "shape": [
                      7168,
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_2/bias",
                  "shape": [
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_3/kernel",
                  "shape": [
                      4096,
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_3/bias",
                  "shape": [
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_4/kernel",
                  "shape": [
                      4096,
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_4/bias",
                  "shape": [
                      4096
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_5/kernel",
                  "shape": [
                      4096,
                      48
                  ],
                  "dtype": "float32"
              },
              {
                  "name": "dense_5/bias",
                  "shape": [
                      48
                  ],
                  "dtype": "float32"
              }
          ]
      }
  ]

}
