{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "batch_input_shape": [null, 56, 2], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [112, 1]}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [8, 2]}}]}}, "training_config": {"loss": "mean_squared_error", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of47.bin", "group1-shard2of47.bin", "group1-shard3of47.bin", "group1-shard4of47.bin", "group1-shard5of47.bin", "group1-shard6of47.bin", "group1-shard7of47.bin", "group1-shard8of47.bin", "group1-shard9of47.bin", "group1-shard10of47.bin", "group1-shard11of47.bin", "group1-shard12of47.bin", "group1-shard13of47.bin", "group1-shard14of47.bin", "group1-shard15of47.bin", "group1-shard16of47.bin", "group1-shard17of47.bin", "group1-shard18of47.bin", "group1-shard19of47.bin", "group1-shard20of47.bin", "group1-shard21of47.bin", "group1-shard22of47.bin", "group1-shard23of47.bin", "group1-shard24of47.bin", "group1-shard25of47.bin", "group1-shard26of47.bin", "group1-shard27of47.bin", "group1-shard28of47.bin", "group1-shard29of47.bin", "group1-shard30of47.bin", "group1-shard31of47.bin", "group1-shard32of47.bin", "group1-shard33of47.bin", "group1-shard34of47.bin", "group1-shard35of47.bin", "group1-shard36of47.bin", "group1-shard37of47.bin", "group1-shard38of47.bin", "group1-shard39of47.bin", "group1-shard40of47.bin", "group1-shard41of47.bin", "group1-shard42of47.bin", "group1-shard43of47.bin", "group1-shard44of47.bin", "group1-shard45of47.bin", "group1-shard46of47.bin", "group1-shard47of47.bin"], "weights": [{"name": "conv1d/kernel", "shape": [32, 1, 32], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [32, 32, 32], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [32, 32, 32], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [3584, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [4096, 16], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [16], "dtype": "float32"}]}]}